rust-lang.rust-analyzer
tamasfe.even-better-toml
ms-azuretools.vscode-docker
zeshuaro.vscode-python-poetry
llvm-vs-code-extensions.vscode-clangd
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
zxh404.vscode-proto3
mads-hartmann.bash-ide-vscode
usernamehw.errorlens